Enums/ВидыМетрик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыМетрик</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>API</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JSON</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Очередь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CircuitBreaker</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОбъектовИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОбъектовИнтеграции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мастера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Транзакции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Клиенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Записи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроверкаСвязи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ЮклайнсAPI/Ext/Module.bsl
#Область ЗапросИСоединениеСYClients

// Возвращает настройки из хранилища значений константы. Создает пустую структуру при отсутствии настроек.
//
// Возвращаемое значение:
//   Структура - настройки, хранящиеся в константе Юклайнс_Настройки
Функция Настройки() Экспорт
    Перем Настройки;
    Хранилище = Константы.Юклайнс_Настройки.Получить();
    Настройки = Хранилище.Получить();
    Если Настройки = Неопределено Тогда
        Настройки = Новый Структура;
    КонецЕсли;
    Возврат Настройки;
КонецФункции

// Выполняет диагностику текущих настроек, выводя их в сообщения.
Процедура ПроверитьТекущиеНастройки() Экспорт
	
	Настройки = Настройки();
	Сообщить("--- [ДИАГНОСТИКА ЮКЛАЙНС] ---");
	Если Настройки.Количество() = 0 Тогда
		Сообщить("ВНИМАНИЕ: Настройки пусты или не инициализированы!");
		Возврат;
	КонецЕсли;
	Для Каждого Настройка Из Настройки Цикл
		Сообщить(Строка(Настройка.Ключ) + ": " + Строка(Настройка.Значение));
	КонецЦикла;
	Сообщить("------------------------------");
КонецПроцедуры

// Возвращает настройки подключения к сервису Юклайнс из констант конфигурации.
//
// Возвращаемое значение:
//   Структура:
//     * URL - Строка - базовый URL сервиса Юклайнс
//     * URLПуть - Строка - путь к API сервиса
//     * ID_Компании - Строка - идентификатор компании
//     * ТокенПартнера - Строка - токен партнера
//     * ТокенПользователя - Строка - токен пользователя
Функция ПолучитьНастройкиПодключения() Экспорт
	НастройкиКонстант = Настройки();
	Настройки = Новый Структура;
	Настройки.Вставить("URL", НастройкиКонстант.ЮклайнсURLБазовый);
	Настройки.Вставить("URLПуть", НастройкиКонстант.ЮклайнсURLПуть);
	Настройки.Вставить("ID_Компании", НастройкиКонстант.ID_Компании);
	ТокенПартнера     = СокрЛП(НастройкиКонстант.ТокенПартнера);
	ТокенПользователя = СокрЛП(НастройкиКонстант.ТокенПользователя);
	Настройки.Вставить("ТокенПартнера",     ТокенПартнера);
	Настройки.Вставить("ТокенПользователя", ТокенПользователя);
	Возврат Настройки;
КонецФункции

// Возвращает структуру параметров для выполнения HTTP-запроса к API Юклайнс
//
// Параметры:
//   ПутьКМетоду - Строка - путь к методу API
//   ТипОперации - Строка - тип выполняемой операции (GET, POST и т.д.)
//   НужнаПагинация - Булево - признак необходимости постраничной навигации, по умолчанию Ложь
//
// Возвращаемое значение:
//   Структура - параметры запроса:
//     * ПутьКМетоду - Строка - путь к методу API
//     * НомерПопытки - Число - номер текущей попытки выполнения
//     * НомерСтраницы - Число - номер страницы (1 если нужна пагинация, 0 если нет)
//     * ТипОперации - Строка - тип операции
//     * МаксПовторов - Число - максимальное количество повторных попыток
//     * Задержка - Число - задержка между попытками в секундах
Функция ПолучитьПараметрыЗапроса(ПутьКМетоду, ТипОперации, НужнаПагинация = Ложь) Экспорт
	Настройки = Настройки();
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ПутьКМетоду", ПутьКМетоду);
	СтруктураПараметров.Вставить("НомерПопытки", 1);
	СтруктураПараметров.Вставить("НомерСтраницы", ?(НужнаПагинация, 1, 0));
	СтруктураПараметров.Вставить("ТипОперации",   ТипОперации);
	СтруктураПараметров.Вставить("МаксПовторов", Настройки.ЮклайнсМаксПовторов);
	СтруктураПараметров.Вставить("Задержка", Настройки.ЮклайнсЗадержкаПовтора);
	Возврат СтруктураПараметров;
КонецФункции

// Возвращает путь с добавленным параметром строки запроса. Если путь уже содержит параметры, использует разделитель "&", иначе "?".
//
// Параметры:
//   Путь - Строка - путь к ресурсу
//   ИмяПараметра - Строка - имя добавляемого параметра
//   Значение - значение добавляемого параметра
//
// Возвращаемое значение:
//   Строка - путь с добавленным параметром строки запроса
Функция ОбновитьПараметрПути(Путь, ИмяПараметра, Значение)
   	Разделитель = ?(СтрНайти(Путь, "?") > 0, "&", "?");
    Возврат Путь + Разделитель + ИмяПараметра + "=" + Формат(Значение, "ЧГ=0");
КонецФункции

// Выполняет HTTP-запрос к API Юклайнс в фоне с поддержкой повторов при ошибках и механизмом circuit breaker
//
// Параметры:
//   СтруктураПараметров - Структура:
//     * ПутьКМетоду - Строка - путь к методу API
//     * НомерСтраницы - Число - номер страницы для пагинации
//     * ПутьМетода - Строка - полное имя метода для логирования
//     * НомерПопытки - Число - номер текущей попытки выполнения
//     * МаксПовторов - Число - максимальное количество повторов при ошибках
//     * Задержка - Число - базовая задержка между попытками в секундах
//     * ТипОперации - Перечисление.ВидыОбъектовИнтеграции - тип операции для обработки ответа
Процедура ВыполнитьHTTPЗапросФон(СтруктураПараметров) Экспорт
	Настройки = Настройки();
	ТекущаяДата  = ТекущаяДатаСеанса();
	БлокировкаДо = Константы.ЮклайнсБлокировкаДо.Получить();
	Если ЗначениеЗаполнено(БлокировкаДо) И ТекущаяДата < БлокировкаДо Тогда
		Возврат; 
	ИначеЕсли ЗначениеЗаполнено(БлокировкаДо) И ТекущаяДата >= БлокировкаДо Тогда
	КонецЕсли;
	ЮК_Настройки = ПолучитьНастройкиПодключения();
	
	Соединение = Новый HTTPСоединение(ЮК_Настройки.URL, 443, , , , 30 , Новый ЗащищенноеСоединениеOpenSSL());
	
	
	ПутьДляЗапроса = СтруктураПараметров.ПутьКМетоду;

	Если СтруктураПараметров.НомерСтраницы > 1 Тогда
	    ПутьДляЗапроса = ОбновитьПараметрПути(ПутьДляЗапроса, "page", СтруктураПараметров.НомерСтраницы);
	КонецЕсли;

	ПолныйПуть = ЮК_Настройки.URLПуть + "/" + ПутьДляЗапроса;
    ПолныйПуть = СтрЗаменить(ПолныйПуть, "//", "/"); 
    
    Запрос = Новый HTTPЗапрос(ПолныйПуть);
	Запрос.Заголовки.Вставить("Content-Type",  "application/json");
	Запрос.Заголовки.Вставить("Accept",        "application/vnd.yclients.v2+json");
	Запрос.Заголовки.Вставить("Authorization", "Bearer " + ЮК_Настройки.ТокенПартнера + ", User " + ЮК_Настройки.ТокенПользователя);
	
	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Попытка
		Ответ = Соединение.Получить(Запрос);
		КодСостояния = Ответ.КодСостояния;
		ТекстОтвета  = Ответ.ПолучитьТелоКакСтроку();
	Исключение
		КодСостояния = 999;
		ТекстОтвета  = "";
		
		Инфо = ИнформацияОбОшибке();
    	Подробности = ПодробноеПредставлениеОшибки(Инфо);
		
		ДанныеДляЛога = Новый Структура;
	    ДанныеДляЛога.Вставить("Метод",      СтруктураПараметров.ПутьМетода);
	    ДанныеДляЛога.Вставить("Попытка",    СтруктураПараметров.НомерПопытки);
	    ДанныеДляЛога.Вставить("СистемноеОписание", Подробности);
		
		ЛогированиеПриложений.Ошибка("API.СетевойКрах", 
        Новый Структура("Объект, Сообщение, ДопДанные", 
            "Юклайнс", 
            "Критический сбой сетевого уровня", 
            РаботаСJSON.Сериализовать(ДанныеДляЛога)));
			
	КонецПопытки;
	
	Длительность = ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачала;
	ДанныеМетрики = Новый Структура;
	ДанныеМетрики.Вставить("ВремяВыполнения", Длительность);
	ДанныеМетрики.Вставить("КодОтвета", КодСостояния);
	ДанныеМетрики.Вставить("РазмерДанных",СтрДлина(ТекстОтвета));
	ДанныеМетрики.Вставить("НомерПопытки", СтруктураПараметров.НомерПопытки);
	ДанныеМетрики.Вставить("Успех", (КодСостояния = 200));

	ЛогированиеСервер.ЗаписатьМетрику(Перечисления.ВидыМетрик.API, СтруктураПараметров.ТипОперации, ДанныеМетрики);
	ЛогированиеПриложений.Инфо("API.Проверка", Новый Структура("Объект, Сообщение, ДопДанные", "","Проверка API", СтруктураПараметров.ПутьКМетоду + " Код:" + КодСостояния));	
	
	Если КодСостояния = 200 Тогда
		Если СтруктураПараметров.ТипОперации = Перечисления.ВидыОбъектовИнтеграции.ПроверкаСвязи Тогда
        
        Константы.ЮклайнсБлокировкаДо.Установить('00010101');
        ЛогированиеПриложений.Инфо("API.CircuitBreaker", Новый Структура("Объект, Сообщение, ДопДанные","Юклайнс","Связь с ЮК восстановлена, блокировка снята.",""));
        
    	Иначе
		ОбработатьУспешныйОтвет(СтруктураПараметров.ТипОперации, ТекстОтвета, );
		Константы.ЮклайнсБлокировкаДо.Установить('00010101');
		КонецЕсли;
	ИначеЕсли (КодСостояния = 429 Или КодСостояния >= 500) 
		И СтруктураПараметров.НомерПопытки < СтруктураПараметров.МаксПовторов Тогда
		СтруктураПараметров.НомерПопытки = СтруктураПараметров.НомерПопытки + 1;
		Пауза = СтруктураПараметров.Задержка * СтруктураПараметров.НомерПопытки;
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(СтруктураПараметров);
		ФоновыеЗадания.ВыполнитьЧерез("ЮклайнсAPI.ВыполнитьHTTPЗапросФон", Пауза, МассивПараметров);
	Иначе
		Если КодСостояния = 429 Или КодСостояния >= 500 Или КодСостояния = 999 Тогда
 
        ИнтервалБлокировки = Настройки.ЮклайнсБлокировкаВремя;
        Константы.ЮклайнсБлокировкаДо.Установить(ТекущаяДата() + ИнтервалБлокировки);
		ДанныеМетрики = Новый Структура;
		ДанныеМетрики.Вставить("КодОтвета", КодСостояния);
		ДанныеМетрики.Вставить("Успех",Ложь);
		ЛогированиеСервер.ЗаписатьМетрику(Перечисления.ВидыМетрик.CircuitBreaker, СтруктураПараметров.ТипОперации, ДанныеМетрики);
		
        ЛогированиеПриложений.Ошибка("API.CircuitBreaker", 
            Новый Структура("Объект, Сообщение, ДопДанные", 
            "Юклайнс", 
            "API ЮК заблокировано на 30 мин", 
            "Метод: " + СтруктураПараметров.ПутьМетода + " Код:" + КодСостояния));
		Иначе
			ЛогированиеПриложений.Ошибка("API.Отказ", Новый Структура("Объект, Сообщение, ДопДанные", "Юклайнс","Ошибка API", СтруктураПараметров.ПутьКМетоду + " Код:" + КодСостояния));	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Обрабатывает успешный ответ от API в формате JSON, проверяет наличие постраничной навигации и планирует загрузку следующей страницы в фоновом режиме
//
// Параметры:
//   ТипОперации - Строка, Неопределено - тип выполненной операции
//   ТелоКакСтрока - Строка - тело ответа в формате JSON
//   СтруктураПараметров - Структура - параметры исходного запроса, содержащие номер страницы
Процедура ОбработатьУспешныйОтвет(ТипОперации, ТелоКакСтрока, СтруктураПараметров)
	Если ТипОперации <> Неопределено Тогда
		ОбработатьОтветJSON(ТелоКакСтрока, ТипОперации);
	Иначе
		ЛогированиеПриложений.Предупреждение("API.НеизвестныйТип",Новый Структура("Объект, Сообщение, ДопДанные", "Юклайнс", "Неизвестный тип операции", "Пришел ответ для неизвестной операции: " + ТипОперации));
	КонецЕсли;
	
	Данные = РаботаСJSON.Десериализовать(ТелоКакСтрока);
	
	Если Данные.Свойство("meta") И ТипЗнч(Данные.meta) = Тип("Структура") Тогда
        Meta = Данные.meta; 
		ТекущаяСтраница = ?(Meta.Свойство("page"), Meta.page, 1);
		ВсегоЗаписей    = ?(Meta.Свойство("total_count"), Meta.total_count, 0);
		ЗаписейНаСтр    = 100;
		
		Если ТекущаяСтраница  * ЗаписейНаСтр  < ВсегоЗаписей Тогда
			НовыеПараметры = СтруктураПараметров;
            НовыеПараметры.НомерСтраницы = СтруктураПараметров.НомерСтраницы + 1; 
		    МассивПараметров = Новый Массив;
		    МассивПараметров.Добавить(НовыеПараметры);
            
            ФоновыеЗадания.Выполнить("ЮклайнсAPI.ВыполнитьHTTPЗапросФон", МассивПараметров);
            ЛогированиеПриложений.Инфо("API.Пагинация", "Запланирована загрузка страницы №" + НовыеПараметры.НомерСтраницы);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Логирует ошибку при получении неудачного ответа от API.
//
// Параметры:
//   ПутьМетода - Строка - путь к методу API, по которому получен неудачный ответ
//   КодОтвета - Число - код ответа, указывающий на ошибку
Процедура ОбработатьНеудачныйОтвет(ПутьМетода, КодОтвета)
	ЛогированиеПриложений.Ошибка("API.НеудачныйОтвет",
		Новый Структура("Объект, ПутьМетода, Код", "Юклайнс", ПутьМетода, КодОтвета));
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаДанныхИзYClients

// Проверяет и валидирует ответ от ЮК API в формате JSON
//
// Параметры:
//   ТекстJSON - Строка - текст ответа в формате JSON
//   ИмяМетода - Строка - имя вызываемого метода для логирования
//
// Возвращаемое значение:
//   Массив - массив данных из свойства data при успешной валидации
//   - Неопределено - если JSON не является структурой, success = false или свойство data отсутствует или не является массивом
Функция ПровалидироватьОтветЮК(ТекстJSON, ИмяМетода) Экспорт
	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Данные = РаботаСJSON.Десериализовать(ТекстJSON);
	
	Если ТипЗнч(Данные) <> Тип("Структура") Тогда
		ЛогированиеПриложений.Ошибка("API.Формат", 
			Новый Структура("Объект, Сообщение, ДопДанные", Строка(ИмяМетода), "JSON не является структурой", ТекстJSON));
		Возврат Неопределено;
	КонецЕсли;

	Если Данные.Свойство("success") И Данные.success = Ложь Тогда
		ЛогированиеПриложений.Ошибка("API.ЮК_Отказ", 
			Новый Структура("Объект, Сообщение, ДопДанные", Строка(ИмяМетода), "Сервер вернул success: false", ТекстJSON));
		Возврат Неопределено;
	КонецЕсли;

	Если Не Данные.Свойство("data") Или ТипЗнч(Данные.data) <> Тип("Массив") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Длительность = ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачала;
	УспехВалидации = (Данные <> Неопределено); 
	ДанныеМетрики = Новый Структура;
	ДанныеМетрики.Вставить("ВремяВыполнения", Длительность);
	ДанныеМетрики.Вставить("Успех",            УспехВалидации);
	ДанныеМетрики.Вставить("РазмерДанных",     СтрДлина(ТекстJSON));
	ЛогированиеСервер.ЗаписатьМетрику(Перечисления.ВидыМетрик.JSON, ИмяМетода, ДанныеМетрики);

	Возврат Данные.data;

КонецФункции

// Обрабатывает ответ JSON от внешнего сервиса, валидирует данные, формирует структуру для очереди
// и записывает метрики обработки.
//
// Параметры:
//   ТекстJSON - Строка - текст ответа в формате JSON
//   ВидОбъекта - Строка - идентификатор типа объекта
Процедура ОбработатьОтветJSON(ТекстJSON, ВидОбъекта) Экспорт
	МассивДанных = ПровалидироватьОтветЮК(ТекстJSON, ВидОбъекта);
	
	МассивДляОчереди = Новый Массив;	
	Для Каждого СтрокаДанных Из МассивДанных Цикл
		
		Если Не СтрокаДанных.Свойство("id") Тогда
			Продолжить;
		КонецЕсли;
		
		ВнешнийID   = Строка(СтрокаДанных.id);
		СтруктураДляОчереди = Новый Структура("ТипОбъекта, ID_Внешний, ДанныеJSON", 
			ВидОбъекта, 
			ВнешнийID, 
			РаботаСJSON.Сериализовать(СтрокаДанных));
		МассивДляОчереди.Добавить(СтруктураДляОчереди);
	КонецЦикла;
	
	КоличествоЗаписей = МассивДляОчереди.Количество();
	
	ДанныеМетрики = Новый Структура;
	ДанныеМетрики.Вставить("РазмерДанных", КоличествоЗаписей);
	ДанныеМетрики.Вставить("Успех",        (КоличествоЗаписей > 0)); 
	ЛогированиеСервер.ЗаписатьМетрику(Перечисления.ВидыМетрик.Очередь, ВидОбъекта, ДанныеМетрики);
	
	Если МассивДляОчереди.Количество() > 0 Тогда
		ЮклайнсОчередьСервер.НовыеЗаписиВРегистрОчедери(МассивДляОчереди);
	КонецЕсли;
	
КонецПроцедуры

// Проверяет связь с YClients в фоновом режиме.
Процедура ПроверкаВыгрузкиИЗYClients() Экспорт
	Настройки = Настройки();
	ПутьМетода = "company/" + Настройки.ID_Компании;
	Параметры = ПолучитьПараметрыЗапроса(ПутьМетода, Перечисления.ВидыОбъектовИнтеграции.ПроверкаСвязи);
	ПараметрыФона = Новый Массив;
	ПараметрыФона.Добавить(Параметры);	
	ФоновыеЗадания.Выполнить("ЮклайнсAPI.ВыполнитьHTTPЗапросФон", ПараметрыФона);
КонецПроцедуры

// Создает фоновое задание для загрузки транзакций из сервиса YClients за указанный период.
Процедура ЗагрузитьОплатыИзYClients() Экспорт	
	Настройки = Настройки();
	ДатаНачала = Формат(Настройки.ДатаНачалаТранзакций, "ДФ=yyyy-MM-dd"); 
	ДатаКонца  = Формат(Настройки.ДатаКонцаТранзакций, "ДФ=yyyy-MM-dd");
 
	ПутьМетода = "transactions/" + Настройки.ID_Компании + "?start_date=" + ДатаНачала + "&end_date=" + ДатаКонца;
	Параметры = ПолучитьПараметрыЗапроса(ПутьМетода, Перечисления.ВидыОбъектовИнтеграции.Транзакции);
	ПараметрыФона = Новый Массив;
	ПараметрыФона.Добавить(Параметры);
	
	ФоновыеЗадания.Выполнить("ЮклайнсAPI.ВыполнитьHTTPЗапросФон", ПараметрыФона);
	
КонецПроцедуры


// Выполняет асинхронную выгрузку списка услуг из системы YClients в фоновом режиме
Процедура ВыгрузитьСписокУслугИзYClients() Экспорт
	Настройки = Настройки();
	ПутьМетода = "company/" + Настройки.ID_Компании + "/services/";
	Параметры = ПолучитьПараметрыЗапроса(ПутьМетода, Перечисления.ВидыОбъектовИнтеграции.Услуги);
	ПараметрыФона = Новый Массив;
	ПараметрыФона.Добавить(Параметры);
	
	ФоновыеЗадания.Выполнить("ЮклайнсAPI.ВыполнитьHTTPЗапросФон", ПараметрыФона);
КонецПроцедуры


// Запускает фоновое задание для выгрузки сотрудников компании из системы YClients
Процедура ВыгрузитьСотрудниковИзYClients() Экспорт
	Настройки = Настройки();
	ПутьМетода = "company/" + Настройки.ID_Компании + "/staff/";
	Параметры = ПолучитьПараметрыЗапроса(ПутьМетода, Перечисления.ВидыОбъектовИнтеграции.Мастера);
	ПараметрыФона = Новый Массив;
	ПараметрыФона.Добавить(Параметры);
	
	ФоновыеЗадания.Выполнить("ЮклайнсAPI.ВыполнитьHTTPЗапросФон", ПараметрыФона);
КонецПроцедуры


// Выполняет в фоновом режиме выгрузку записей из системы YClients за указанный период
Процедура ВыгрузитьЗаписиИзYClients() Экспорт
	Настройки = Настройки();
	ДатаНачала = Формат(Настройки.ДатаНачалаЗаписей, "ДФ=yyyy-MM-dd");
	ДатаКонца = Формат(Настройки.ДатаКонцаЗаписей, "ДФ=yyyy-MM-dd");
	ПутьМетода = "records/" + Настройки.ID_Компании + "?start_date=" + ДатаНачала + "&end_date=" + ДатаКонца;
	Параметры = ПолучитьПараметрыЗапроса(ПутьМетода, Перечисления.ВидыОбъектовИнтеграции.Записи);
	ПараметрыФона = Новый Массив;
	ПараметрыФона.Добавить(Параметры);
	
	ФоновыеЗадания.Выполнить("ЮклайнсAPI.ВыполнитьHTTPЗапросФон", ПараметрыФона);
КонецПроцедуры

#КонецОбласти
